# Ukraine refugees: Totals and locations

Source: [United Nations High Commissioner for Refugees](https://data2.unhcr.org/en/situations/ukraine)

In [1]:
%load_ext lab_black

In [2]:
import pandas as pd
import geopandas as gpd
import altair as alt
import urllib.request, json

In [3]:
pd.options.display.max_columns = 1000
pd.options.display.max_rows = 1000

---

## Totals

In [4]:
totals_url = "https://data2.unhcr.org/population/get/timeseries?widget_id=283561&sv_id=54&population_group=5457&frequency=day&fromDate=1900-01-01&currentSeries=0"

In [5]:
with urllib.request.urlopen(totals_url) as url:
    totals = json.loads(url.read().decode())

In [6]:
total_df = (
    pd.DataFrame(totals["data"]["timeseries"])
    .rename(columns={"data_date": "date"})
    .drop(["unix_timestamp"], axis=1)
)

In [7]:
total_df["cumsum"] = total_df["individuals"].cumsum()

In [8]:
total_df

         date  individuals   cumsum
0  2022-02-24        79208    79208
1  2022-02-25       115157   194365
2  2022-02-26       150472   344837
3  2022-02-27       171080   515917
4  2022-02-28       156771   672688
5  2022-03-01       197081   869769
6  2022-03-02       174753  1044522
7  2022-03-03       165655  1210177
8  2022-03-04       173455  1383632

---

## Locations

In [9]:
locations_url = "https://data2.unhcr.org/population/get/sublocation?geo_id=0&forcesublocation=1&widget_id=283557&sv_id=54&color=%233c8dbc&color2=%23303030&population_group=5460"

In [10]:
with urllib.request.urlopen(locations_url) as url:
    locations = json.loads(url.read().decode())

In [11]:
locations_df = (
    pd.DataFrame(locations["data"])
    .rename(columns={"geomaster_name": "country", "geomaster_id": "id"})
    .drop(
        [
            "admin_level",
            "source",
            "population_groups_concat",
            "population_group_id",
            "individuals_type",
            "demography_type",
            "households",
            "population_groups",
            "color",
            "published",
            "lat_max",
            "lon_max",
            "lat_min",
            "lon_min",
        ],
        axis=1,
    )
)

In [12]:
locations_df

,country,id,centroid_lon,centroid_lat,date,month,year,individuals,numChildren
0,Poland,10781,19.4013,52.1224,2022-03-04,3,2022,756303,0
1,Hungary,10783,19.4131,47.1672,2022-03-04,3,2022,157004,0
2,Republic of Moldova,10784,28.4646,47.1976,2022-03-03,3,2022,103254,0
3,Slovakia,10785,19.4864,48.7062,2022-03-04,3,2022,101529,0
4,Romania,10782,25.3,45.8667,2022-03-04,3,2022,63192,0
5,Russian Federation,10791,38.1556078125,51.488850139616,2022-03-03,3,2022,53300,0
6,Belarus,10786,28.0463,53.5384,2022-03-04,3,2022,406,0

---

## Exports

In [13]:
total_df.to_csv("data/processed/ukraine_refugees_totals_timeseries.csv", index=False)
locations_df.to_csv("data/processed/ukraine_refugees_totals_countries.csv", index=False)